Robbie2D2/FreeRTOS_PIC18F67K22/port.c
	}

	/* Was the interrupt a byte being received? */
	/*if( PIR1bits.RCIF )
	{
		_asm
			goto vSerialRxISR
		_endasm
	}*/

	/* Was the interrupt the Tx register becoming empty? */
	/*if( PIR1bits.TXIF )
	{
		if( PIE1bits.TXIE )
		{
			_asm
				goto vSerialTxISR
			_endasm
		}
	}*/
}
#pragma code

/*-----------------------------------------------------------*/

/*
 * ISR for the tick.
 * This increments the tick count and, if using the preemptive scheduler, 
 * performs a context switch.  This must be identical to the manual 
 * context switch in how it stores the context of a task. 
 */
static void prvTickISR( void )
{
	/* Interrupts must have been enabled for the ISR to fire, so we have to 
	save the context with interrupts enabled. */
	portSAVE_CONTEXT( portGLOBAL_INTERRUPT_FLAG );
    PIR4bits.CCP4IF=0;//portBIT_CLEAR;//0;
//    TMR1H = ( unsigned char ) 0x00;
//    TMR1L = ( unsigned char ) 0x00;

	//PIR3bits.CCP1IF = 0;
    //INTCONbits.TMR0IF = 0;
	/* Maintain the tick count. */
	vTaskIncrementTick();

	#if configUSE_PREEMPTION == 1
	{
		/* Switch to the highest priority task that is ready to run. */
		vTaskSwitchContext();
	}
	#endif

	portRESTORE_CONTEXT();
}
/*-----------------------------------------------------------*/

/*
 * Setup a timer for a regular tick.
 */
static void prvSetupTimerInterrupt( void )
{
const unsigned long ulConstCompareValue = ( ( configCPU_CLOCK_HZ / portTIMER_FOSC_SCALE ) / configTICK_RATE_HZ );
unsigned long ulCompareValue;
unsigned char ucByte;

	/* Interrupts are disabled when this function is called.
     
	Setup CCP1 to provide the tick interrupt using a compare match on timer
	1.

	Clear the time count then setup timer. */
	TMR1H = ( unsigned char ) 0x00;
	TMR1L = ( unsigned char ) 0x00;

	/* Set the compare match value. */
	ulCompareValue = ulConstCompareValue;
	CCPR1L = ( unsigned char ) ( ulCompareValue & ( unsigned long ) 0xff );
	ulCompareValue >>= ( unsigned long ) 8;
	CCPR1H = ( unsigned char ) ( ulCompareValue & ( unsigned long ) 0xff );	
    
    /* We are only going to use the global interrupt bit, so set the peripheral
	bit to true. */
	INTCONbits.GIEL = portBIT_SET;

//	CCP1CONbits.CCP1M0 = portBIT_SET;	/*< Compare match mode. */
//	CCP1CONbits.CCP1M1 = portBIT_SET;	/*< Compare match mode. */
//	CCP1CONbits.CCP1M2 = portBIT_CLEAR;	/*< Compare match mode. */
//	CCP1CONbits.CCP1M3 = portBIT_SET;	/*< Compare match mode. */
//	PIE3bits.CCP1IE = portBIT_SET;		/*< Interrupt enable. */
    CCP4CONbits.CCP4M0 = portBIT_SET;
    CCP4CONbits.CCP4M1 = portBIT_SET;
    CCP4CONbits.CCP4M2 = portBIT_CLEAR;
    CCP4CONbits.CCP4M3 = portBIT_SET;
    PIE4bits.CCP4IE = portBIT_SET;
    
	

	/* Provided library function for setting up the timer that will produce the
	tick. */
    OpenTimer1( T1_16BIT_RW & T1_SOURCE_FOSC_4 &  T1_PS_1_1 , TIMER_GATE_OFF );
   
    //CCPTMRS1bits.C1TSEL0 = portBIT_CLEAR;
    //CCPTMRS1bits.C1TSEL1 = portBIT_CLEAR;
    CCPTMRS1bits.C4TSEL0 = portBIT_CLEAR;
    CCPTMRS1bits.C4TSEL1 = portBIT_CLEAR;
    //CCPTMRS0bits.C1TSEL0 = portBIT_CLEAR;
    //CCPTMRS0bits.C1TSEL1 = portBIT_CLEAR;
    
    //SetTmrCCPSrc(0b10111111);//T12_CCP1_T34_CCP2345);
    
	//OpenTimer1( T1_16BIT_RW & T1_SOURCE_FOSC ,  T1_PS_1_1 );//& T1_CCP1_T3_CCP2 );
    //OpenTimer1( T1_16BIT_RW & T1_SOURCE_INT & T1_PS_1_1 & T1_CCP1_T3_CCP2 );//original
    
    //Timer1 Registers Prescaler= 1 - TMR1 Preset = 25325 - Freq = 99.48 Hz - Period = 0.010053 seconds
//    T1CONbits.T1CKPS1 = 0;   // bits 5-4  Prescaler Rate Select bits
//    T1CONbits.T1CKPS0 = 0;   // bit 4
//    T1CONbits.SOSCEN = 1;
//    T1CONbits.TMR1CS = 0;    // bit 1 Timer1 Clock Source Select bit...0 = Internal clock (FOSC/4)
//    TMR1H = 0xC1;             // preset for timer1 MSB register
//    TMR1L = 0x80;             // preset for timer1 LSB register
//    IPR1bits.TMR1IP = 0;
//    PIE1bits.TMR1IE = 1;
//    PIR1bits.TMR1IF = 0;
//    T1CONbits.RD16 = 1;
//    T1CONbits.TMR1ON = 1;
  
    
    
    
    
    
//      //Config timer0 1 ms a 60MHz/4
//    T0CONbits.T08BIT = 0;
//    T0CONbits.T0CS = 0;
//    T0CONbits.PSA = 1;
//    TMR0H = 0xC1;
//    TMR0L = 0x80;
//    
//    // Interrupt TMR0 configuration and Enable
//    INTCONbits.TMR0IF = 0;
//    INTCON2bits.TMR0IP = 0; //Low Priority
//    //Timer0 on
//    INTCONbits.TMR0IE = 1; //interrupt enable
//    T0CONbits.TMR0ON = 1;
//    
//    /* We are only going to use the global interrupt bit, so set the peripheral
//	bit to true. */
//	INTCONbits.GIEL = portBIT_SET;
    
    
}

